#Задайте последовательность чисел. 
#Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

#specifiedList = list(map(int, input("Введите числа через пробел:\n").split()))
specifiedList = 1, 2, 5, 45, 7, 9, 45, 5, 3
#print(f"Исходный список: {specifiedList}")

new_list = []
new_list.append(i):
    for i in specifiedList 
        if i not in new_list
print(f"Из списка {specifiedList}\nнеповторяющиеся элементы: {new_list}")